#Напишите программу, которая на вход получает число, а на выход возвращает True, если число целое и False во всех остальных случаях. Используйте ветвления :)

a=float(input("введите число "))
if a%1==0:
	print(1==1)
else:
	print(1==0)
